# Data Mangling with pandas
Mark Santcroos, Department of Human Genetics, Leiden University Medical Center

Examples and ideas taken from: [Jupyter Documentation](https://pandas.pydata.org/pandas-docs/stable/10min.html)

# Introduction

## Powerful Python data analysis toolkit

pandas is a Python package aiming to provide
- **fast**
- **flexible**
- **expressive**

data structures designed to make working with

- **relational**
- **labeled**

data both
- **easy**
- **intuitive**

## Suitable for data of all sorts

- Tabular data with columns of different data types (as in an SQL table or Excel spreadsheet)
- Ordered and unordered time series data (not necessarily fixed-frequency)
- Arbitrary matrix data with row and column labels (homogeneously typed or heterogeneous)
- Any other form of observational / statistical data sets (the data  need not be labeled to be placed into a pandas data structure)

## Primary data structures

- Series (1-dimensional)
- DataFrame (2-dimensional)

For R users, DataFrame provides everything that Râ€™s data.frame provides and much more.

pandas is built on top of NumPy and is intended to integrate well within a scientific computing environment with many other 3rd party libraries.

# Getting started

In [471]:
import pandas as pd
import numpy as np

In [472]:
pd.__version__

u'0.20.1'

# Object creation

## Series

In [473]:
# Create Series with missing data
s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

## DataFrame

In [474]:
# Create DatetimeIndex for 6 days
dates = pd.date_range('20170901', periods=6)
dates

DatetimeIndex(['2017-09-01', '2017-09-02', '2017-09-03', '2017-09-04',
               '2017-09-05', '2017-09-06'],
              dtype='datetime64[ns]', freq='D')

In [475]:
# Create 6x4 NP array with random values
ran_values = np.random.randn(6,4)
ran_values

array([[-0.19285917,  0.32914174,  1.05612678,  0.90109364],
       [-0.52196454, -0.77643073, -0.05150983,  0.87993839],
       [ 0.82601868, -0.44544422,  2.14961986,  1.79456143],
       [ 0.37800763, -0.55051725,  1.70024071,  0.85985274],
       [-0.35328306,  2.52404431, -0.73611908, -0.32295207],
       [ 0.68458742, -0.49398027,  0.17228974, -0.11312861]])

In [476]:
df = pd.DataFrame(ran_values, columns=list('ABDC'))

In [477]:
df

          A         B         D         C
0 -0.192859  0.329142  1.056127  0.901094
1 -0.521965 -0.776431 -0.051510  0.879938
2  0.826019 -0.445444  2.149620  1.794561
3  0.378008 -0.550517  1.700241  0.859853
4 -0.353283  2.524044 -0.736119 -0.322952
5  0.684587 -0.493980  0.172290 -0.113129

In [478]:
df.set_index(dates, inplace=True)

In [479]:
df

                   A         B         D         C
2017-09-01 -0.192859  0.329142  1.056127  0.901094
2017-09-02 -0.521965 -0.776431 -0.051510  0.879938
2017-09-03  0.826019 -0.445444  2.149620  1.794561
2017-09-04  0.378008 -0.550517  1.700241  0.859853
2017-09-05 -0.353283  2.524044 -0.736119 -0.322952
2017-09-06  0.684587 -0.493980  0.172290 -0.113129

In [480]:
# Create DataFrame by using a dict of series-like objects.
df2 = pd.DataFrame({ 'A' : 1.,
                     'B' : pd.Timestamp('20170920'),
                     'C' : pd.Series(1, index=list(range(4)), dtype='float32'),
                     'D' : np.array([3] * 4, dtype='int32'),
                     'E' : pd.Categorical(["LUMC","EMC","LUMC","EMC"]),
                     'F' : 'researcher'
                   })
df2

     A          B    C  D     E           F
0  1.0 2017-09-20  1.0  3  LUMC  researcher
1  1.0 2017-09-20  1.0  3   EMC  researcher
2  1.0 2017-09-20  1.0  3  LUMC  researcher
3  1.0 2017-09-20  1.0  3   EMC  researcher

In [481]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

# Tab completion

In [482]:
# df.<TAB> shows attributes and column names

# Exploring data

## Top (head) and bottom (tail) of data

In [483]:
df.head()

                   A         B         D         C
2017-09-01 -0.192859  0.329142  1.056127  0.901094
2017-09-02 -0.521965 -0.776431 -0.051510  0.879938
2017-09-03  0.826019 -0.445444  2.149620  1.794561
2017-09-04  0.378008 -0.550517  1.700241  0.859853
2017-09-05 -0.353283  2.524044 -0.736119 -0.322952

In [484]:
df.tail(2)

                   A         B         D         C
2017-09-05 -0.353283  2.524044 -0.736119 -0.322952
2017-09-06  0.684587 -0.493980  0.172290 -0.113129

## Meta data

In [485]:
df.index

DatetimeIndex(['2017-09-01', '2017-09-02', '2017-09-03', '2017-09-04',
               '2017-09-05', '2017-09-06'],
              dtype='datetime64[ns]', freq='D')

In [486]:
df.columns

Index([u'A', u'B', u'D', u'C'], dtype='object')

In [487]:
df.values

array([[-0.19285917,  0.32914174,  1.05612678,  0.90109364],
       [-0.52196454, -0.77643073, -0.05150983,  0.87993839],
       [ 0.82601868, -0.44544422,  2.14961986,  1.79456143],
       [ 0.37800763, -0.55051725,  1.70024071,  0.85985274],
       [-0.35328306,  2.52404431, -0.73611908, -0.32295207],
       [ 0.68458742, -0.49398027,  0.17228974, -0.11312861]])

## Basic statistics

In [488]:
df.describe()

              A         B         D         C
count  6.000000  6.000000  6.000000  6.000000
mean   0.136751  0.097802  0.715108  0.666561
std    0.568525  1.246603  1.107521  0.774252
min   -0.521965 -0.776431 -0.736119 -0.322952
25%   -0.313177 -0.536383  0.004440  0.130117
50%    0.092574 -0.469712  0.614208  0.869896
75%    0.607942  0.135495  1.539212  0.895805
max    0.826019  2.524044  2.149620  1.794561

## Transposing data

In [489]:
df.T

   2017-09-01  2017-09-02  2017-09-03  2017-09-04  2017-09-05  2017-09-06
A   -0.192859   -0.521965    0.826019    0.378008   -0.353283    0.684587
B    0.329142   -0.776431   -0.445444   -0.550517    2.524044   -0.493980
D    1.056127   -0.051510    2.149620    1.700241   -0.736119    0.172290
C    0.901094    0.879938    1.794561    0.859853   -0.322952   -0.113129

## Sorting

In [490]:
# Sort on axis
df.sort_index(axis=1)

                   A         B         C         D
2017-09-01 -0.192859  0.329142  0.901094  1.056127
2017-09-02 -0.521965 -0.776431  0.879938 -0.051510
2017-09-03  0.826019 -0.445444  1.794561  2.149620
2017-09-04  0.378008 -0.550517  0.859853  1.700241
2017-09-05 -0.353283  2.524044 -0.322952 -0.736119
2017-09-06  0.684587 -0.493980 -0.113129  0.172290

In [491]:
# Sort by value
df.sort_values(by='B')

                   A         B         D         C
2017-09-02 -0.521965 -0.776431 -0.051510  0.879938
2017-09-04  0.378008 -0.550517  1.700241  0.859853
2017-09-06  0.684587 -0.493980  0.172290 -0.113129
2017-09-03  0.826019 -0.445444  2.149620  1.794561
2017-09-01 -0.192859  0.329142  1.056127  0.901094
2017-09-05 -0.353283  2.524044 -0.736119 -0.322952

# Data Selection

## Label based

In [492]:
# Select column, which returns a series
df['A']

2017-09-01   -0.192859
2017-09-02   -0.521965
2017-09-03    0.826019
2017-09-04    0.378008
2017-09-05   -0.353283
2017-09-06    0.684587
Freq: D, Name: A, dtype: float64

In [493]:
# Row based
df[1:4]

                   A         B         D         C
2017-09-02 -0.521965 -0.776431 -0.051510  0.879938
2017-09-03  0.826019 -0.445444  2.149620  1.794561
2017-09-04  0.378008 -0.550517  1.700241  0.859853

In [494]:
# Or index based
df['20170902':'20170904']

                   A         B         D         C
2017-09-02 -0.521965 -0.776431 -0.051510  0.879938
2017-09-03  0.826019 -0.445444  2.149620  1.794561
2017-09-04  0.378008 -0.550517  1.700241  0.859853

In [495]:
# Cross section using a label
df.loc['2017-09-02']

A   -0.521965
B   -0.776431
D   -0.051510
C    0.879938
Name: 2017-09-02 00:00:00, dtype: float64

In [496]:
# Multi access selection based on label
df.loc[:,['A','B']]

                   A         B
2017-09-01 -0.192859  0.329142
2017-09-02 -0.521965 -0.776431
2017-09-03  0.826019 -0.445444
2017-09-04  0.378008 -0.550517
2017-09-05 -0.353283  2.524044
2017-09-06  0.684587 -0.493980

In [497]:
# Multi dimension label slicing
df.loc['20170902':'20170904',['B','C']]

                   B         C
2017-09-02 -0.776431  0.879938
2017-09-03 -0.445444  1.794561
2017-09-04 -0.550517  0.859853

In [498]:
# Reduced dimension of return object for single rows
df.loc['20170902',['A','B']]

A   -0.521965
B   -0.776431
Name: 2017-09-02 00:00:00, dtype: float64

In [499]:
# Scalar values
df.loc['20170902','A']

-0.52196454176237395

## Position based
The semantics follow closely python and numpy slicing.

In [500]:
# Row
df.iloc[3]

A    0.378008
B   -0.550517
D    1.700241
C    0.859853
Name: 2017-09-04 00:00:00, dtype: float64

In [501]:
# Multi dimension
df.iloc[3:5,2:4]

                   D         C
2017-09-04  1.700241  0.859853
2017-09-05 -0.736119 -0.322952

In [548]:
# Select rows only
df.iloc[1:3,:]

          A         B        C         D
1  1.101153  0.511268  2.18607 -0.537892
2  1.088524 -0.368635  2.29340 -0.928082

In [551]:
# Select columns only
df.iloc[:,1:3]

          B         C
0  0.000000 -0.462917
1  0.511268  2.186070
2 -0.368635  2.293400
3 -0.174253  0.551263
4  0.407453 -0.268319
5 -0.054129  0.550049
6 -0.006808  0.257429
7 -1.300045  0.034432

In [504]:
df.iloc[1,1]

-0.77643072890241949

## Boolean indexing

In [505]:
# Using a single columnâ€™s values to select data.
df[df.A > 0]

                   A         B         D         C
2017-09-03  0.826019 -0.445444  2.149620  1.794561
2017-09-04  0.378008 -0.550517  1.700241  0.859853
2017-09-06  0.684587 -0.493980  0.172290 -0.113129

In [506]:
# Selecting values from a DataFrame where a boolean condition is met.
df[df < 0]

                   A         B         D         C
2017-09-01 -0.192859       NaN       NaN       NaN
2017-09-02 -0.521965 -0.776431 -0.051510       NaN
2017-09-03       NaN -0.445444       NaN       NaN
2017-09-04       NaN -0.550517       NaN       NaN
2017-09-05 -0.353283       NaN -0.736119 -0.322952
2017-09-06       NaN -0.493980       NaN -0.113129

In [507]:
# Create new copy and add extra column
df3 = df.copy()
df3['E'] = ['one', 'one','two','three','four','three']
df3

                   A         B         D         C      E
2017-09-01 -0.192859  0.329142  1.056127  0.901094    one
2017-09-02 -0.521965 -0.776431 -0.051510  0.879938    one
2017-09-03  0.826019 -0.445444  2.149620  1.794561    two
2017-09-04  0.378008 -0.550517  1.700241  0.859853  three
2017-09-05 -0.353283  2.524044 -0.736119 -0.322952   four
2017-09-06  0.684587 -0.493980  0.172290 -0.113129  three

In [508]:
# Use isin() filtering
df3[df3['E'].isin(['two','four'])]

                   A         B         D         C     E
2017-09-03  0.826019 -0.445444  2.149620  1.794561   two
2017-09-05 -0.353283  2.524044 -0.736119 -0.322952  four

# Modifying data

In [509]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20170902', periods=6))

s1

2017-09-02    1
2017-09-03    2
2017-09-04    3
2017-09-05    4
2017-09-06    5
2017-09-07    6
Freq: D, dtype: int64

In [510]:
# Add column F, align by original index
df['F'] = s1
df

                   A         B         D         C    F
2017-09-01 -0.192859  0.329142  1.056127  0.901094  NaN
2017-09-02 -0.521965 -0.776431 -0.051510  0.879938  1.0
2017-09-03  0.826019 -0.445444  2.149620  1.794561  2.0
2017-09-04  0.378008 -0.550517  1.700241  0.859853  3.0
2017-09-05 -0.353283  2.524044 -0.736119 -0.322952  4.0
2017-09-06  0.684587 -0.493980  0.172290 -0.113129  5.0

In [511]:
# Setting values by label
df.at['20170902','A'] = 0
df

                   A         B         D         C    F
2017-09-01 -0.192859  0.329142  1.056127  0.901094  NaN
2017-09-02  0.000000 -0.776431 -0.051510  0.879938  1.0
2017-09-03  0.826019 -0.445444  2.149620  1.794561  2.0
2017-09-04  0.378008 -0.550517  1.700241  0.859853  3.0
2017-09-05 -0.353283  2.524044 -0.736119 -0.322952  4.0
2017-09-06  0.684587 -0.493980  0.172290 -0.113129  5.0

In [547]:
# Set value at two dimensional location
df.iat[0,1] = 0
df

          A         B         C         D
0 -0.779759  0.000000 -0.462917  0.454674
1  1.101153  0.511268  2.186070 -0.537892
2  1.088524 -0.368635  2.293400 -0.928082
3 -2.578025 -0.174253  0.551263  1.667782
4  2.352340  0.407453 -0.268319  0.456224
5  0.178936 -0.054129  0.550049 -0.751988
6 -0.781786 -0.006808  0.257429  1.408943
7  2.114814 -1.300045  0.034432 -1.969593

In [513]:
# Setting a column based on a numpy array
df.loc[:,'D'] = np.array([5] * len(df))
df

                   A         B  D         C    F
2017-09-01 -0.192859  0.000000  5  0.901094  NaN
2017-09-02  0.000000 -0.776431  5  0.879938  1.0
2017-09-03  0.826019 -0.445444  5  1.794561  2.0
2017-09-04  0.378008 -0.550517  5  0.859853  3.0
2017-09-05 -0.353283  2.524044  5 -0.322952  4.0
2017-09-06  0.684587 -0.493980  5 -0.113129  5.0

## Setting with matching rule

In [546]:
df2 = df.copy()
df2[df2 > 0] = -df2
df2

          A         B         C         D
0 -0.779759 -1.266825 -0.462917 -0.454674
1 -1.101153 -0.511268 -2.186070 -0.537892
2 -1.088524 -0.368635 -2.293400 -0.928082
3 -2.578025 -0.174253 -0.551263 -1.667782
4 -2.352340 -0.407453 -0.268319 -0.456224
5 -0.178936 -0.054129 -0.550049 -0.751988
6 -0.781786 -0.006808 -0.257429 -1.408943
7 -2.114814 -1.300045 -0.034432 -1.969593

# Missing data

- pandas  uses the value np.nan to represent missing data
- It is by default not included in computations.

In [515]:
# reindex (copy) a subset of the data and add an empty column E
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])
# Set E to 1 for first two rows
df1.loc[dates[0]:dates[1],'E'] = 1
df1

                   A         B  D         C    F    E
2017-09-01 -0.192859  0.000000  5  0.901094  NaN  1.0
2017-09-02  0.000000 -0.776431  5  0.879938  1.0  1.0
2017-09-03  0.826019 -0.445444  5  1.794561  2.0  NaN
2017-09-04  0.378008 -0.550517  5  0.859853  3.0  NaN

In [516]:
# Drop all rows that have any unknown values
df1.dropna(how='any')

              A         B  D         C    F    E
2017-09-02  0.0 -0.776431  5  0.879938  1.0  1.0

In [517]:
# Replace NA with value
df1.fillna(value=42)

                   A         B  D         C     F     E
2017-09-01 -0.192859  0.000000  5  0.901094  42.0   1.0
2017-09-02  0.000000 -0.776431  5  0.879938   1.0   1.0
2017-09-03  0.826019 -0.445444  5  1.794561   2.0  42.0
2017-09-04  0.378008 -0.550517  5  0.859853   3.0  42.0

In [518]:
# Show the boolean mask
pd.isnull(df1)

                A      B      D      C      F      E
2017-09-01  False  False  False  False   True  False
2017-09-02  False  False  False  False  False  False
2017-09-03  False  False  False  False  False   True
2017-09-04  False  False  False  False  False   True

# Operations

## Basic (stat) operators

In [519]:
# Mean per column
df.mean() # similar to axis=0

A    0.223745
B    0.042945
D    5.000000
C    0.666561
F    3.000000
dtype: float64

In [520]:
# Mean per row
df.mean(axis=1)

2017-09-01    1.427059
2017-09-02    1.220702
2017-09-03    1.835027
2017-09-04    1.737469
2017-09-05    2.169562
2017-09-06    2.015496
Freq: D, dtype: float64

## Apply

In [521]:
# Create my own function that returns the negated value
def my_func(val):
    return -val
# Apply my function to all values
df.apply(my_func)

                   A         B  D         C    F
2017-09-01  0.192859 -0.000000 -5 -0.901094  NaN
2017-09-02 -0.000000  0.776431 -5 -0.879938 -1.0
2017-09-03 -0.826019  0.445444 -5 -1.794561 -2.0
2017-09-04 -0.378008  0.550517 -5 -0.859853 -3.0
2017-09-05  0.353283 -2.524044 -5  0.322952 -4.0
2017-09-06 -0.684587  0.493980 -5  0.113129 -5.0

## Histogramming

In [522]:
s = pd.Series(np.random.randint(0, 7, size=10))
s

0    2
1    1
2    2
3    2
4    5
5    5
6    1
7    1
8    2
9    3
dtype: int64

In [523]:
s.value_counts()

2    4
1    3
5    2
3    1
dtype: int64

## Concatinating data

In [524]:
# Create 10x4 table with random numbers
df = pd.DataFrame(np.random.randn(10, 4))
df

          0         1         2         3
0 -0.330694  0.872756  2.112683 -1.388585
1  0.057223  0.618802 -0.914080  0.252215
2 -1.139711  0.816206  1.008724 -1.672792
3  0.072709  0.074521 -0.089053 -0.132791
4  0.502954  1.068275  0.415517  1.218068
5 -1.710858 -0.176961  1.161903 -1.412063
6  0.876638 -0.302195 -1.360723 -2.326562
7 -0.888707 -0.609472 -0.241537 -1.974217
8 -0.301339 -0.329511 -0.040340  0.168655
9 -0.432671 -0.518209  1.575212 -0.901535

In [544]:
# Split them into 3 chunks (row-based)
chunks = [df[:3], df[3:7], df[7:]]
chunks

[          A         B         C         D
 0 -0.779759  1.266825 -0.462917  0.454674
 1  1.101153  0.511268  2.186070 -0.537892
 2  1.088524 -0.368635  2.293400 -0.928082,
           A         B         C         D
 3 -2.578025 -0.174253  0.551263  1.667782
 4  2.352340  0.407453 -0.268319  0.456224
 5  0.178936 -0.054129  0.550049 -0.751988
 6 -0.781786 -0.006808  0.257429  1.408943,
           A         B         C         D
 7  2.114814 -1.300045  0.034432 -1.969593]

In [545]:
# add them back together
pd.concat(chunks)

          A         B         C         D
0 -0.779759  1.266825 -0.462917  0.454674
1  1.101153  0.511268  2.186070 -0.537892
2  1.088524 -0.368635  2.293400 -0.928082
3 -2.578025 -0.174253  0.551263  1.667782
4  2.352340  0.407453 -0.268319  0.456224
5  0.178936 -0.054129  0.550049 -0.751988
6 -0.781786 -0.006808  0.257429  1.408943
7  2.114814 -1.300045  0.034432 -1.969593

## Joining data
Many ways to combine multiple dataframes.

In [527]:
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})

In [528]:
left

   key  lval
0  foo     1
1  foo     2

In [529]:
right

   key  rval
0  foo     4
1  foo     5

In [530]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [531]:
left = pd.DataFrame({'key': ['foo', 'bar'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['foo', 'bar'], 'rval': [4, 5]})

In [532]:
left

   key  lval
0  foo     1
1  bar     2

In [533]:
right

   key  rval
0  foo     4
1  bar     5

In [534]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  bar     2     5

## Appending rows

In [543]:
# create a 8x4 matrix
df = pd.DataFrame(np.random.randn(8, 4), columns=['A','B','C','D'])
df

          A         B         C         D
0 -0.779759  1.266825 -0.462917  0.454674
1  1.101153  0.511268  2.186070 -0.537892
2  1.088524 -0.368635  2.293400 -0.928082
3 -2.578025 -0.174253  0.551263  1.667782
4  2.352340  0.407453 -0.268319  0.456224
5  0.178936 -0.054129  0.550049 -0.751988
6 -0.781786 -0.006808  0.257429  1.408943
7  2.114814 -1.300045  0.034432 -1.969593

In [536]:
# extract a row
s = df.iloc[3]
s

A    0.421181
B    1.607888
C   -0.011656
D   -0.166280
Name: 3, dtype: float64

In [537]:
# append the extract row at the end
df.append(s, ignore_index=False).reindex()

          A         B         C         D
0  1.460591 -1.167721 -0.838375 -1.239544
1  1.670965  2.563498 -0.103847 -1.104923
2 -1.515473  0.327335  0.329841 -1.149319
3  0.421181  1.607888 -0.011656 -0.166280
4  1.967833  0.506429  1.675263  0.763151
5 -1.781919 -1.503685  0.366258 -1.276055
6 -0.222054  1.231713 -0.358001 -0.407226
7  0.717591 -0.060166  0.008006 -0.513181
3  0.421181  1.607888 -0.011656 -0.166280

## Grouping

Value based grouping in order to execute methods on the results.

In [538]:
# Create 
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar',
                          'foo', 'bar', 'foo', 'foo'],
                   'B' : ['one', 'one', 'two', 'three',
                              'two', 'two', 'one', 'three'],
                   'C' : np.random.randn(8),
                   'D' : np.random.randn(8)})
df

     A      B         C         D
0  foo    one  0.776501  1.452913
1  bar    one -0.731479 -0.924116
2  foo    two -0.204101  0.044840
3  bar  three -0.343739 -0.683006
4  foo    two -1.519019  0.103475
5  bar    two  1.271579 -2.176090
6  foo    one -0.741659 -0.561117
7  foo  three -0.174572  1.281778

In [539]:
df.groupby('A').sum()

            C         D
A
bar  0.196361 -3.783212
foo -1.862851  2.321889

In [540]:
df.groupby(['A','B']).sum()

                  C         D
A   B
bar one   -0.731479 -0.924116
    three -0.343739 -0.683006
    two    1.271579 -2.176090
foo one    0.034842  0.891796
    three -0.174572  1.281778
    two   -1.723120  0.148315

## Reshaping using pivot_table

In [541]:
# Create a flat table with duplicated entries
df = pd.DataFrame({'A' : ['one', 'one', 'two', 'three'] * 3,
                       'B' : ['X', 'Y', 'Z'] * 4,
                       'C' : ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
                       'D' : np.random.randn(12),
                       'E' : np.random.randn(12)})
df

        A  B    C         D         E
0     one  X  foo  1.057110 -0.108982
1     one  Y  foo  1.037212  0.477061
2     two  Z  foo  1.375108  0.205573
3   three  X  bar -0.383392  1.279249
4     one  Y  bar  0.378141  0.166755
5     one  Z  bar -0.528378  0.405889
6     two  X  foo  0.406508  0.054299
7   three  Y  foo -0.937294  0.251400
8     one  Z  foo  0.750334  0.880497
9     one  X  bar  0.827021 -0.148973
10    two  Y  bar -0.143651 -0.729501
11  three  Z  bar -0.205862  1.432239

In [542]:
# Create a pivot table using A and B as the index, making C columns, and using D as the values (E is not used)
pd.pivot_table(df, values='D', index=['A', 'B'], columns=['C'])

C             bar       foo
A     B
one   X  0.827021  1.057110
      Y  0.378141  1.037212
      Z -0.528378  0.750334
three X -0.383392       NaN
      Y       NaN -0.937294
      Z -0.205862       NaN
two   X       NaN  0.406508
      Y -0.143651       NaN
      Z       NaN  1.375108

# Further information
- https://pandas.pydata.org/pandas-docs/stable/index.html
- https://stackoverflow.com with pandas tag